# ExtrusionAutoParams Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ExtrusionAutoParams Property
ParameterTypeId Class See Also
---
"Auto ends"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ExtrusionAutoParams { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtrusionAutoParams As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ExtrusionAutoParams {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace